function fillAmmo(types) {
    let filterBlock = document.getElementById("ammoCategoryItem");
    filterBlock.onclick = function () {
        // todo дожен раскрыться блок и показать на 1 уровне типы боеприпасов лазерное, ракетное, стрелковое
        // todo при нажатие на эти блоки раскрывается дальше и спрашивает какой размер 1,2,3
        // todo при нажатие сюда показывает все типы подходящие под условие
        // todo при нажатие на тип фильтруется рынок, заполняются заголовки в магазине
    }
}